[
  {
    "path": "posts/2021-06-18-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Interactive visualisation for Singapore's Merchandise Trade with its Trading Partners, 2011-2020",
    "author": [
      {
        "name": "Connie Xia",
        "url": "https://example.com/conniexia"
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n1. Critique of Original Data Visualisation\r\n\r\nThe original data visualisation is evaluated for its clarity and aesthetics as follows:\r\n1.1. Clarity\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nAbsence of a title – Without a title, it is difficult for the viewers to understand what exactly the data visualisation is about.\r\nSuggest to include an appropriate title like Merchandise Trade Performance with Singapore’s Trade Partners at the top of the data visualisation.\r\n2\r\nAxis labels are not clear - Both axes are labelled from 0 to 80 without specifying the measurement or units of the values. Upon scrutinisation, it is revealed from the call-outs that the values are measured in billions and have a monetary value.\r\nSuggest to add in the units (S$B) in the axis titles or standardise the measurements so that the actual raw values are reflected on the axis labels.\r\n3\r\nNet trade values with each trading partner are unclear - Under the notes, it is revealed that if the value of imports exceed exports, the centre point (white circle) of the bubble will fall in the “Net Importers” section that is shaded blue; and if the value of exports exceed imports, the white circle will fall in the “Net Exporters” section that is shaded green. However, as all the bubbles have full opacity and some bubbles are covered by other bubbles, it is unclear to tell what exactly the trade balance is.\r\nSuggest to use a red-blue diverging colour scheme to reflect the net trade balance: Red to mean trade deficit and Blue to mean trade surplus, so that it would be clearer to determine which trading partners are Singapore’s net importers and exporters respectively.\r\n4\r\nLack of direct link between the written observation and the bubble plot - The observation at the bottom of the visualisation compared Singapore’s trade values with its trading partners across different time periods, which is not explicitly shown in the bubble plot. THe is no time aspect revealed from the bubble plot.\r\nSuggest to include in the time component in the visualisation, making it an interactive one.\r\n1.2. Aesthetics\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nOveruse of colours in the data visualisation – Colours should be used to serve a particular purpose like highlighting a particular meaning in data. Yet in this case, the usage of ten different colours to represent the ten different trading partners adds no meaning to the data visualisation.\r\nIt is perhaps more applicable to stick to a diverging colour scheme to show Singapore’s export and import values with each trading partner’s export and import on the bubble plot instead of using a colour to represent each trading partner.\r\n2\r\nSize of bubbles of bubble plot are too large - Although bubble size is used to show the total merchandise trade value with the respective trade partnenrs, the bubble sizes seem to be too large, making the entire plot look very cluttered.\r\nSuggest to reduce the size of the bubbles accordingly so as to prevent over-cluttering of the bubble plot.\r\n3\r\nLocation of the axis titles might be confusing - Both the y-axis and x-axis titles are located at the bottom and left of origin of the plot respectively, which is an uncommon and confusing way to label the axes titles. Without the colour guide, one may accidentally read the axes the other way round due to the positioning of the axes titles.\r\nSuggest to adopt the default way of labelling the axis title, which is having the y-axis title as a rotated title on the left of the y-axis and the x-axis title below of the x-axis.\r\n4\r\nAbsence of axis markers on the plot - Tick marks are not present on the bubble plot, making it difficult to figure out the exact positions of the values and determine the corresponding export and import values.\r\nSuggest to add in major tick marks of appropriate darkness since both axes are in continuous scale.\r\n2. Proposed Design\r\nBased on the critics raised above, an alternative graphical presentation has been sketched out to improve the current design.\r\n\r\n2.1. Advantages of the Proposed Design\r\nThe advantages of the proposed design are as follows.\r\nClarity\r\nS/N\r\nDesign\r\nAdvantages\r\n1\r\nClear title and subtitles\r\nThe title and subtitle gives an overaching theme of what the visualisation is about.\r\n2\r\nAxis markers are clearly labelled\r\nAxis markers for the bubble plot are denominated in billion dollars for easily understanding of what the axes represents\r\n3\r\nAddition of animation and filters for interactivity\r\nFilters and animation are included for Years, Trade Partners and Region/Market in this design to be able to toggle around, customising different views to one’s liking, as well as to avoid the problem of overcrowding.\r\n4\r\nTooltips are used to include in added insights\r\nTHe usage of tooltips can effectively and directly point out observations. Another bar chart is embedded in the tooltip to showcase the balance of trade with each individual trading partners over the span of 10 years.\r\n5\r\nReference lines are added\r\nThe demarcation of reference lines is used to compare the data values displayed on the bubble plot with the calculated average.\r\nAesthestics\r\nS/N\r\nDesign\r\nAdvantages\r\n1\r\nEffective use of colours\r\nColours are only used to represent trade surplus and trade deficit, to bring about a cleaner visualisation.\r\n2\r\nBubble sizes are adjusted accordingly\r\nBubble sizes are set in a way that isn’t too large or too small, so that it can be seen clearly, at the same time not overcrowdinb the entire plot.\r\n3\r\nAxes titles are positioned clearly \r\nThe default settings of the axis label on the side of the y-axis and bottom of the x-axis, makes it easy for the viewers to read and understand as it is the most conventional way of labelling the axes.\r\n4\r\nAxis markers are added for continuous data\r\nMajor tickmarks point to us the exact point on the axis that the axis label defines.\r\n3. Proposed Visualisation\r\nThe alternative static visualisation is created using Tableau Desktop and is uploaded onto Tableau Public here.\r\n4. Step-by-step Guide\r\n4.1. Data Used\r\nTwo data sources are used which are available under the sub-section of Merchandise Trade by Region/Market on the DOS website. The two datasets are then all downloaded and saved as outputFile.xlsx.\r\nAfter opening the outputFile in Excel, we can see that there are three sheets: Content, T1 and T2. The Content sheet is basically a content page for the datasets found in the Excel file. T1 shows all Merchandise Imports By Region/Market, Monthly and T2 shows all Merchandise Exports By Region/Market, Monthly.\r\n4.2. Data Preparation\r\nStep 1: Import the data in Tableau Desktop by dragging and dropping the outputFile onto the Tableau Start Page.\r\nStep 2: Check the Use Data Interpreter box to help identify the structure of the data and help in our data cleaning and manipulation.\r\n\r\nStep 3: Drag and drop T1 onto the Tableau workspace.\r\nAs we have made use of the Data Interpreter to help us understand the data structure, the data will be nicely reflected in a tabular form.\r\n\r\nStep 4: Filter the data by the trading partners to exclude Total Merchandise Imports.\r\nClick on the Add Filter button on the top right of the pane. A new window will pop up and select the Add button. Scroll all the way around and select Variables before clicking OK. Another window will show and make sure all the checkboxes are checked, with the exception of Total Merchandise Imports(Thousand Dollars).\r\n\r\nStep 5: Rename the Variables header to Trading Partners by double-clicking on the Variables word.\r\n\r\nStep 6: Pivot the table by selecting all the time period columns and right click to choose Pivot.\r\n\r\nStep 7: Rename the Pivot Field Names and Pivot Field Values to Time Period and Import Value respectively.\r\n\r\nStep 8: Change the data type of the Time Period column from string data type to Date.\r\nTo do so, click on the icon on the top left of the column header and choose Date.\r\n\r\nStep 9: Filter the data by Time Period to only include in data from January 2011 to December 2020.\r\nClick on the Edit Filter button on the top right of the pane, before adding another filter. Choose Time Period and select Year to pick Years 2011 to 2020 to keep.\r\n\r\nStep 10: Export the file as a csv file under Data > Export Data as CSV > T1 and save it as Imports_data.csv.\r\n\r\nStep 11: Repeat steps 3 to 10 for T2 and save the file as Exports_data.csv.\r\nStep 12: In a new Tableau workspace, drag and drop in the Imports_data.csv file.\r\nAt the left pane, we can see both the Imports_data.csv and Exports_data.csv files. Drag and drop the Imports_data.csv node into the workspace.\r\n\r\nStep 13: Merge the two Imports_data.csv and Exports_data.csv files.\r\nTo do so, double click on the Import_data.csv node in the workspace and drag the Export_data.csv node into the workspace. Then, click on the Venn diagram between the two nodes and make sure the Inner join is selected. Join the two datasets by Time Period and Trading Partners before closing the callout box.\r\n\r\nStep 14: The two duplicated columns: Time Period (Exports data.csv) and Trading Partners (Exports data.csv) can now be hidden.\r\nSelect the two columns and click on the small triangle located on the top right of the column header and select Hide.\r\n\r\nStep 15: The Trading Partners column is then split into two new columns showing the name of the trading partner and the units of measurement for the trade data.\r\nClick on the small triangle located on the top right of the column header again and this time, choose Split.\r\n\r\nStep 16: The new columns Trading Partners - Split 1 and Trading Parters - Split 2 are then renamed to Trade Partners and Units respectively by double-clicking on the header names and typing in the new header names.\r\n\r\nStep 17: Create a new Calculated Field for the Import Value to scale and synchronise the values accordingly as some values are reflected in millions and others in thousands.\r\nRight click on the Imports Value and select Create Calculated Field and add in the following formula to compute the raw values of the imports. Rename the field as Imports.\r\n\r\nStep 18: Repeat Step 16 to create a new Calculated Field for the Export Value too and rename the field as Exports.\r\nStep 19: Now, we can hide the Trading Partners, Unit, Export Value and Import Value columns.\r\n\r\nStep 20: Create a new Calculated Field called Trade Balance to derive Singapore’s trade balance with its trading partners with the following formula.\r\n\r\nStep 21: Create a new Calculated Field called Total Trade to derive the total merchandise trade Singapore has with its trading partners with the following formula.\r\n\r\nWith that, the basic cleaning and data manipulation of Singapore’s merchandise trade dataset is completed and we can now move on to the data visualisation part.\r\n4.3. Data Visualisation\r\nStep 1: Click on the Sheet 1 on the bottom of the Tableau Workspace and be directed to the visualisation workspace.\r\n\r\nStep 2: Drag and drop the Exports and Imports nodes into the Columns and Rows respectively, to arrive at the following graph.\r\n\r\nStep 3: Drag and drop the Trade Partners node into the Details box to see the distribution of Singapore’s trading partners in terms of exports and imports.\r\n\r\nStep 4: Drag and drop the Trade Partners node into the Filter pane and click OK.\r\n\r\nStep 5: Click on the small triangle on the side of the Trade Partners to reveal a dropdown box.\r\nSelect on Show Filter to make the check box filter appear on the right side of the workspace. Filter the trading partners to only show European Union, Hong Kong, Indonesia, Japan, Mainland China, Malaysia, Republic Of Korea, Taiwan, Thailand and the United States to focus on these trading partners first. As this is going to be an interactive visualisation, we can always choose different trading partners from the Filter bar to look at their results.\r\n\r\nStep 6: Drag and drop the Total Trade node into the Size box, so that the size of the circles reflect the total merchandise trade Singapore has with its respective trading partners.\r\nClick on the Size box to adjust the size of the circles accordingly by dragging the slider.\r\n\r\nStep 7: Change the graph type from Automatic to Circle to show a bubble plot with shaded bubbles.\r\n\r\nStep 8: Drag and drop the Trade Balance node to the Color box to show the net trade with each trading partner.\r\nClick on the Color box and choose a light grey border for the bubbles under Effects > Border. Under Edit Colors, select the Red-Blue Diverging colour palette in the drop down box. Check Use Full Color Range. Under Advanced settings, make sure that the Center check box is ticked and the center is set at 0. Apply the settings and click OK.\r\n\r\nStep 9: Drag and drop the Trade Partners node to the Label box, so that the names of the trade partners will be shown on the bubble plot for easy reference.\r\n\r\nStep 10: Add in axis lines and tick marks.\r\nRight click on the x-axis and select Format. The Format pane will appear on the left of the workspace. Under the Axis pane and Scale tab, select the drop down box at Numbers and choose Currency (Custom). Make the decimal places = 0 and display units as Billions (B). Do the exact same for the y-axis as well.\r\nClick on the Lines tab at the top of the Format pane to be directed to the Format Lines pane. At the Sheet tab, add in light grey markers for the Axis Rulers and the Axis Ticks.\r\n\r\nStep 11: Add in references lines on both the y-axis and x-axis to reflect the average imports and exports values.\r\nRight click on the x-axis and select Add Reference Line. A pop up will appear and select Average in the drop down box and Custom as the label. Type in “Avg exports =” before pressing on the arrow button at the side to choose Value.\r\nUnder the Formatting section, click on the drop down box for Line. Choose the first Dotted Line and select the line thickness to be the thinnest. Use a light grey colour for the line.\r\nRepeat the same to add in a reference line on the y-axis as well to show the average imports.\r\n\r\nStep 12: Create a new Calculated Field to add in a Ranking by Net Exports.\r\nRight click on the left pane and select Create Calculated Field. Type in the following formula to rank the trading partners by their Net Exports to Singapore.\r\n\r\nStep 13: Similarly, create another new Calculated Field to add in a Ranking by Net Imports.\r\nRight click on the left pane and select Create Calculated Field. This time, type in the similar formula as above but change ‘desc’ to ‘asc’ instead, to rank the trading partners by their Net Imports to Singapore.\r\n\r\nStep 14: Drag and drop both Ranking by Net Exports and Ranking by Net Imports into the Tooltip box.\r\n\r\nStep 15: Next, click on the small triangle on the corner of the Ranking by Exports icon and select Compute Using > Trade Partners to be rank the export values by the trading partners.\r\nDo the same for the Ranking by Imports to sort the ranking by trading partners.\r\n\r\nStep 16: Now, when we mouse over the bubbles, we can see a call out box showing the Trade Partner, Imports, Exports, Trade Balance, Total Trade and both net imports’ and exports’ rankings. We can see that the values for the Trade Balance and Total Trade are in their raw forms. So, it would be wise to standardised them to reflect their values in billions.\r\n\r\nStep 17: In order to do so, click on the small triangle on the corner of the SUM(Trade Balance) icon and select Format. The Format pane will appear on the left. At the Pane tab, under the Default section, choose Currency (Custom) under the Numbers drop down box, and set the decimal places to 2 and display units as Billions (B).\r\n\r\nStep 18: Do the same to adjust for the Total Trade, at the SUM(Total Trade) icon.\r\nStep 19: Add two new Calculated Fields called Net Exports and Net Imports to pull out Singapore’s trade surplus and trade deficit respectively, with its trading partners.\r\nRight click to add a Calculated Field and type in the following formulas.\r\n\r\nStep 20: Drag and drop the Net Exports and Net Imports nodes into the Tooltip box.\r\nScale the numbers to reflect the trade values in Billions. Click on the small triangle at the corner of the AGG(Net Imports) and AGG(Net Exports) icons and select Format. Under the Pane tab, adjust the numbers such that their decimal places are 2 and display units are in Billions (B).\r\n\r\nStep 21: Once that is done, we can now rewrite the message to be shown in the Tooltip. Click on the Tooltip button and recraft the wordings as follows.\r\n\r\nStep 22: Drag and drop the Time Period node into the Filter box. Select Years in the new pop up window and click Next. Click OK.\r\n\r\nStep 23: Click on the small triangle at the YEAR(Time Period) node and select Show Filter.\r\n\r\nStep 24: At the YEAR(Time Period) pane located at the right of the workspace, click on the small triangle and from the drop down list, choose Single Value (list) to activate the radio button option to choose from the Year list.\r\n\r\nStep 25: Next, ensure that the Show “All” Value option is unchecked.\r\nTo do so, click on the small triangle at the YEAR(Time Period) pane again. Under Customise, uncheck the Show “All” Value option.\r\n\r\nStep 26: Now, in a new Sheet, drag and drop Time Period and Trade Balance into the Columns and Rows, respectively.\r\n\r\nStep 27: Change the graph type from Automatic to Bar.\r\n\r\nStep 28: Increase the Size of the bars by dragging the scroll to the right, so as to reduce the gaps between each individual bars.\r\n\r\nStep 29: At the top of the bar chart, right click on the Time Period header and select Hide Field Labels for Columns.\r\nIt is self-explanatory that the categorical variables are in time format, so it is not necessary to include a similar header too.\r\n\r\nStep 30: Drag and drop Trade Balance node into the Color box and Edit Colors by clicking on the small triangle of the SUM(Trade Balance) pane, located at the right hand side. Choose a Red-Blue Diverging colour palette with 2 stepped colours. Under Advanced settings, ensure that the Center is set at 0.\r\n\r\nStep 31: Rename Sheet 2 to Annual Trade Balance by double-clicking on the title.\r\n\r\nStep 32: Adjust the axes accordingly by adding in the monetary units of measurement, tick marks and axis line to the y-axis, and the axis line to the x-axis, under the Format pane.\r\nRight click on the y-axis and select Format. Under the Format pane on the left, choose the Currency (Custom) option under the Axis section and set the decimal places and display units accordingly.\r\nClick on the Lines button to add in Axis Rulers and Axis Ticks, and choose a grey colour to show on the bar chart.\r\n\r\nStep 33: Resize the bar chart to small as possible as we want to embed this bar chart into the tooltip of our previous visualisation.\r\n\r\nStep 34: Rename both Sheet 1 and Sheet 2 to Merchandise Trade Performance and Annual Trade Balance respectively.\r\nStep 35: Now, we can go back to Sheet 1 and add in the bar chart to its ToolTip. Click onto the Tooltip and select Insert > Sheets > Annual Trade Balance to add in the diagram to the bottom of the Tooltip.\r\n\r\nStep 36: Mousing over the bubbles will show the Annual Trade Balance graph in the tooltip, but the graph is cut. In order to show the entire graph, click on the Tooltip button and change the maxwidth from 300 to 500.\r\n\r\nStep 37: Change the title to Singapore’s Trade Performance with its Trading Partners.\r\nIn order to add in an interactive year that changes when different years are picked, click on the Insert button and choose YEAR(Time Period) to activate the interactivity.\r\n\r\nStep 38: Add a new Dashboard and drag and drop the Merchandise Trade Performance sheet into the workspace.\r\n\r\nStep 39: Under the Size section, change from Fixed size to Automatic, so that the dashboard will automatically adjust itself on different viewing platforms.\r\n\r\nStep 40: Remove the Total Trade section from the dashboard.\r\n\r\nStep 41: Change the title of the Year of Time Period to Year by right clicking on the title of the Year of Time Period pane and selecting Edit Title.\r\n\r\nStep 42: Add in animation to smoothen the transition, while toggling between different years.\r\n\r\nStep 43: Looking at the data visualisation, it seemed that both the regions and markets are combined in the same bubble plot, making analysis of the visualisation tedious. We can go back to the Data Source tab and add in a new Calculated Field as follows. As the Singapore’s trade values with the different regions are denominated in millions and the country’s trade values with different markets are denominated in thousands, we can separate the trading partners in regions and markets easily, with the following formula:\r\n\r\nStep 44: Now, go to the Merchandise Trade Performance sheet and add in a new filter. Drag the Region/Market node into the Filter section and show the filter on the right hand of the workspace. Edit the check boxes to radio buttons instead so as to individually toggle between All, Region and Market.\r\n\r\nStep 45: The final visualisation would look something like this after captions regarding the observations are added.\r\n\r\n5. Major Observations Derived\r\nThe major observations derived from new data visualisation are as follows:\r\nLooking at Singapore’s merchandise trade by markets, we can observe that Hong Kong is Singapore’s top net exporter since 2011 and the United States was Singapore’s top net importer before it was overtaken by Taiwan from 2018 onwards. However, when we examine Singapore’s merchandise trade by region, Asia and Europe has been successful in being Singapore’s top net exporter and importer for the past 10 years.\r\nThe top 10 trading partners of Singapore (in terms of total trade value) are Mainland China, Malaysia, United States, Hong Kong, Taiwan, Japan, Republic of Korea, Indonesia and Thailand, in no particular order. It is interesting to note that Singapore has been in constant trade deficit with Taiwan and Japan over the past 10 years and constant trade surplus with Mainland China, Hong Kong, Indonesia and Thailand. Singapore starts to be in trade deficit with Malaysia since 2019, previously being a net exporter to Malaysia. The country also became in trade surplus with both Republic of Korea and the United States in 2017 and 2020, respectively.\r\nBoth average exports and imports out of and into Singapore dropped by approximately 2.75% and 5.85% respectively from 2019 to 2020. This could be due to the COVID-19 pandemic which originated in Wuhan, China in December 2019 and has been on-going. Measures to contain and curb the spread of the virus undoubtedly affecting trade, as shown from the decreased trade value over the year.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T21:35:39+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-05-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Explore different perspectives and approaches to design more truthful and enlightening data visualisation",
    "author": [
      {
        "name": "Connie Xia",
        "url": "https://example.com/conniexia"
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\r\n1. Critique of Original Data Visualisation\r\n\r\nThe original data visualisation above is created from the data extracted from the Department of Statistics, Singapore (DOS), showing the Merchandise Trade of the Top Six Trading Countries, 2019-2020. The original visualisation is then evaluated for its clarity and aesthetics as follows.\r\n1.1. Clarity\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nData visualisation is inconsistent with the title – The title says “Merchandise Trade of Top Six Trading Countries, 2019-2020” but for Japan, only the 2020 trade is reflected.\r\nEnsure that the data visualisation for all six countries reflect trade from between 2019 to 2020.\r\n2\r\nUnclear y-axis labels - The y-axes are labelled as “Export” and “Import” respectively but they do not tell us if the numbers are reflecting trade volume or trade value.\r\nChange the y-axes labels to include units: Export (in $000’s) and Import (in $000’s).\r\n3\r\nAxis labels are not consistent - Hong Kong’s import y-axis label is reflected in thousands whereas the rest of the y-axes labels are in millions.\r\nStandardise all the y-axes labels to millions.\r\n4\r\nNo source is provided - Without the source, we cannnot tell where the data is taken from.\r\nInclude a caption of the source at the bottom of the visualisation.\r\n1.2. Aesthetics\r\nS/N\r\nCritiques\r\nSuggestions\r\n1\r\nAxis markers are too light to be seen.\r\nDarken the axis markers slightly so that they can be seen yet aren’t too dark and distracting.\r\n2\r\nArea chart may not be the most appropriate chart to use - The import area chart overlays the export area chart totally, making it difficult to see the export area chart.\r\nChange the chart type to a line graph instead to better visualise the time series data.\r\n3\r\nTop bottom alignment of the charts makes it difficult to compare the trade value across countries.\r\nSuggest to have one chart showing the consolidated line graphs of each country’s exports and another chart showing the consolidated line graphs of each country’s imports for a better comparison across countries.\r\n4\r\nLocation of the legend - There are white spaces below the legend.\r\nShift the location of the legend to the bottom of the visualisation.\r\n2. Proposed Design\r\nBased on the critics raised above, an alternative graphical presentation has been sketched out to improve the current design.\r\n\r\n2.1. Advantages of the Proposed Design\r\nThe advantages of the proposed design are as follows:\r\nClarity\r\nS/N\r\nDesign\r\nAdvantages\r\n1\r\nClear title and subtitle\r\nTitle reflected the Merchandise Trade by Country from 2019 to 2020. The subtitle will have a short description defining “merchandise trade” for clearer understanding.\r\n2\r\nAxes are properly labeled\r\nThe y-axis is properly labeled with standardised tick marks to reflect trade value and the x-axis is labeled to depict time by months.\r\n3\r\nCommentary on observations are inserted above the charts\r\nA short paragraph describing the general observations noted from the charts can help to summarise what the charts are showing.\r\n4\r\nA bar graph showing trade balance is created in addition to the export and import line graphs\r\nA bar chart showing negative or positive trade value can better showcase the financial health of each country.\r\n4\r\nSource is added to the bottom right of the visualisation\r\nInclusion of the source will allow readers to easily know where the data is extracted from.\r\nAesthestics\r\nS/N\r\nDesign\r\nAdvantages\r\n1\r\nVisible major axis markers are used.\r\nMajor axis markers are added and positioned properly to add a more refined look to the charts.\r\n2\r\nColour is carefully utilised\r\nFor the line graphs showing different trade values for different countries, a colour is assigned to each country for better visualisation.\r\n3\r\nAnnotations are added on the graph\r\nAnnotations help to pick out note-worthy trends observed at different time frames that would be useful for further analysis.\r\n4\r\nLegend is placed at the bottom left of the visualisation\r\nA legend is added to reflect which coloured line correspond to which country as it will be too cluttered to include the country names on the line graph itself.\r\n3. Proposed Visualisation\r\nThe alternative static visualisation is created using Tableau Desktop and is uploaded onto Tableau Public here.\r\n4. Step-by-step Guide\r\n4.1. Data Used\r\nTwo data sources are used which are available under the sub-section of Merchandise Trade by Region/Market on the DOS website.The two datasets are then all downloaded in Excel.\r\n4.2. Data Preparation\r\nAfter opening the file in Excel, we can see that there are three sheets: Content, T1 and T2. The Content sheet is basically a content page for the datasets found in the Excel file. T1 shows all Merchandise Imports By Region/Market, Monthly and T2 shows all Merchandise Exports By Region/Market, Monthly. These two sheets are then renamed as Imports and Exports respectively for clearer identification. The Content sheet can now be deleted.\r\nUnder the Imports sheet, data cleaning is conducted to only retain information pertinent to the six countries and time period depicted in the original visualisation.\r\nRemove all unnecessary and empty rows. Delete Rows 1 to 5, 127 to 140.\r\n\r\nDelete rows that do not belong to Hong Kong, Mainland China, Japan, Malaysia, Taiwan and the United States.\r\n\r\nDelete columns that do not fall within the range of 2019 Jan to 2020 Dec. Only retain Columns SX to TU.\r\n\r\nRename Cell A1 from “Variables” to “Country”.\r\nRename Cells A2 to A7 to “Malaysia”, “Japan”, “Hong Kong”, “Taiwan”, “Mainland China” and “United States” respectively.\r\nRepeat Steps 1 to 5 for the Exports sheet as well.\r\nSave the Excel file as Merchandise Trade by Country.\r\nImport the Excel file into Tableau Desktop for further data cleaning.\r\nDrag and drop the Export sheet into the data pane.\r\n\r\nNotice that the data type for the Export values are all in String form. Change that to Numerical data type.\r\n\r\nThe Export values from 2019 Jan to 2020 Dec are illustrated in many columns, but we would like the time series data to be spread across rows instead. Hence, select the columns from 2019 Jan to 2020 Dec, right click and pivot.\r\n\r\nRename the new headers of the pivoted table to “Month” and “Export (in $000’s)” respectively.\r\n\r\nChange the data type of the Month column from String to Date.\r\n\r\nOnce done, export the data as csv and rename it as Exports_Pivoted.\r\n\r\nRepeat steps 9 to 14 for the Imports sheet and name the new csv file as Imports_Pivoted.\r\nOpen the two csv files in Excel and join them by Country and Month so that the Export and Import values are in the same csv file.\r\n\r\nCreate a new column Net Exports (in $000’s) in Column E and calculate the Net Exports by subtracting the Import value from the Export value.\r\n\r\nSave and rename the csv file as Trade_Pivoted.\r\nImport the Trade_Pivoted csv file back into Tableau for data visualisation.\r\n4.3. Data Visualisation\r\nInspect the imported data to ensure that all the data types are correct. Month should be in Date format and the Exports (in $000’s), Imports (in $000’s) and Net Exports (in $000’s) are in Numerical format.\r\nClick into a new Sheet and rename “Sheet 1” to “Exports”.\r\nCreate a line chart by dragging Month and Exports (in $000’s) into Columns and Rows respectively.\r\n\r\nChange the discrete Year(Month) in the column to show continuous Month(Month) instead.\r\n\r\nDrag and drop Country into the Color tab.\r\n\r\nRename the Title to Exports by Country.\r\n\r\nReduce the line thickness of the line chart under the Size tab.\r\n\r\nEdit the y-axis by right clicking on the y-axis and selecting Edit Axis. Under the General tab, set a fixed range from 0 to 8,500,000. Under the Tick Marks tab, set fixed major tick marks with the Tick interval = 1,000,000.\r\n\r\nEdit the x-axis by right clicking on the x-axis and selecting Edit Axis. Under the General tab, set a fixed range from 1/1/2019 to 1/12/2020 and uncheck the Show times box. Rename the Axis Title to Month. Under the Tick Marks tab, set fixed major tick marks with Tick origin starting on 1/3/2019, with Interval = 3 and Unit set to Months.\r\n\r\nFormat the y-axis by right clicking on the y-axis and selecting Format. Under Scale, select the Ticks dropdown box and choose a darker shade of grey so that the major tick marks are visible on the graph. Repeat the step to format the x-axis as well.\r\n\r\nAdd Axis Rulers to both the y-axis and x-axis under the Format Lines section, Rows and Columns tabs, respectively.\r\n\r\nThe final Exports chart would look like this:\r\n\r\nDuplicate the Exports Sheet and rename the sheet to Imports.\r\nRemove Exports (in $000’s) from the Rows and replace with Imports (in $000’s).\r\n\r\nRename the Title to Imports by Country.\r\nEdit the y-axis by right clicking on the y-axis and selecting Edit Axis. Under the General tab, set a fixed range from 0 to 7,000,000. Under the Tick Marks tab, set fixed major tick marks with the Tick interval = 1,000,000.\r\n\r\nThe final Imports chart would look like this:\r\n\r\nCreate a new Sheet and rename it as Trade Balance.\r\nDrag Month into Columns and make sure to show the discrete Year and Month. Drag Country and Net Exports (in $000’s) into Rows.\r\n\r\nChange the chart type from Line to Bar under the Marks section.\r\n\r\nChange the display setting at the top of the page from Standard to Entire View to ensure that the bar chart is fitted nicely on the page.\r\n\r\nDrag and drop the Net Exports (in $000’s) into the Color tab.\r\n\r\nEdit the colour scheme to only show 2 colours: Blue for positive values and Red for negative values by indicating 2 steps under Stepped Color. Under Advanced settings, set the Center to 0.\r\n\r\nIncrease the size of the bars under the Size tab to decrease the gaps between each bars.\r\n\r\nEdit the y-axis by right clicking the y-axis and select Edit Axis. Choose Independent axis ranges for each row or column under the General tab.\r\nRight click on the y-axis and select Format. Under Scale, select the Ticks dropdown box and choose a darker shade of grey so that the major tick marks are visible on the graph.\r\n\r\nFormat the x-axis by right clicking the x-axis and select Format. Under Date, choose Abbreviation to shorten the length of the months.\r\n\r\nThe final Trade Balance chart would look like this:\r\n\r\nA new dashboard is created to combine the three charts together, A title “Merchandise Trade by Country, 2019-2020” is added at the top. Descriptions of observations are added in text above the charts, with annotations added on the charts as well, and the legend for the Exports and Imports charts is added at the left bottom of the dashboard. A text box with the Source is added to the right bottom of the dashboard. The finalised dashboard would look like this:\r\n\r\n5. Major Observations Derived\r\nThe three major observations derived from new data visualisation are as follows:\r\nOverall, China has the highest merchandise export and import values. Yet over the period of December 2019 to January 2020, there is a strong decrease in both exports and imports value, from approximately $7M to $4M and $6.4M to $4M, respectively before showing some recovery in March 2020.\r\nAll six countries experienced in a fall in import value from January 2019 to Februrary 2019 in varying degrees. Similar for export value, only China saw a rise in export value over the same time frame.\r\nOver the two-year period, Hong Kong is constantly having stable trade surplus whereas Taiwan is constantly in stable trade deficit. Malaysia starts to be in constant trade deficit in 2020 and US is seeing positive trade balance from the 2nd quarter of 2020, after being in trade deficit for 5 quarters straight.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T18:18:40+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-my-1st-post/",
    "title": "My 1st Post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Connie Xia",
        "url": "https://example.com/conniexia"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\nOverview\r\nIn this article, we will show you how to plot a figure with multiple histograms by using ggplot2 and ggpubr packages.\r\nInstalling and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\n  + to create a new R Markdown document.\r\nTo insert a graph.\r\n\r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\nR code\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\nfor(p in packages){library if(!require(p, character.only = T)){ install.packages(p) } library(p, character.only = T) }\r\nImporting and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\nImporting Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\nR code\r\nwine <- read_csv(“data/wine_quality.csv”)\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted by using ggplot() and geom_histogram() of ggplot2 package. Then, ggarrange() of ggpubr package is used to patch these histogram into a single figure to reveal the distribution of the selected variables in the wine quality data sets.\r\nRcode\r\nfa <- ggplot(data=wine, aes(x= fixed acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) va <- ggplot(data=wine, aes(x= volatile acidity)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ca <- ggplot(data=wine, aes(x= citric acid)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) rs <- ggplot(data=wine, aes(x= residual sugar)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) ch <- ggplot(data=wine, aes(x= chlorides)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) fSO2 <- ggplot(data=wine, aes(x= free sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) tSO2 <- ggplot(data=wine, aes(x= total sulfur dioxide)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) density <- ggplot(data=wine, aes(x= density)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) pH <- ggplot(data=wine, aes(x= pH)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) sulphates <- ggplot(data=wine, aes(x= sulphates)) + geom_histogram(bins=20, color=“black”, fill=“light blue”) alcohol <- ggplot(data=wine, aes(x= alcohol)) + geom_histogram(bins=20, color=“black”, fill=“light blue”)\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T22:54:24+08:00",
    "input_file": {}
  }
]
